In [25]:
import pandas as pd
from word2number import w2n
from sklearn import linear_model

In [3]:
df=pd.read_csv("/Users/sudhanshukumar/Documents/Machine Learning/csv files/hiring.csv")
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [47]:
df.experience=df.experience.fillna("zero")  #filling all NaN with zeros
df.experience

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [57]:
for e in range(len(df.experience)):     #converting strings to numeric value
    df.experience[e]=w2n.word_to_num(df.experience[e])
df.experience

/Users/sudhanshukumar/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: object

In [61]:
med=df.test_score.median()

In [62]:
df.test_score=df.test_score.fillna(med)   #putting median value at NaN
df.test_score

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: test_score, dtype: float64

In [64]:
df   #final value after data pre-processing

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2          5         6.0                7   60000
3          2        10.0               10   65000
4          7         9.0                6   70000
5          3         7.0               10   62000
6         10         8.0                7   72000
7         11         7.0                8   80000

In [65]:
reg=linear_model.LinearRegression()

In [69]:
X=df.drop("salary",axis=1)
y=df.salary

In [70]:
reg.fit(X,y)  #training the model

LinearRegression()

1. 2 yr experience, 9 test score, 6 interview score

2.12 yr experience, 10 test score, 10 interview score

In [73]:
print(reg.predict([[2,9,6]]))

print(reg.predict([[12,10,10]]))

[53205.96797671]
[92002.18340611]